InformationRegisters/омг_ТокеныАвторизацииСервисов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>омг_ТокеныАвторизацииСервисов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяЖизниВСекундах</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Токен</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ВнутренняяЛаборатория_СопоставлениеНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ВнутренняяЛаборатория_СопоставлениеНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НеобходимыйОбъем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>омг_КоличествоИсследований</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>омг_КодГруппыЗабора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>омг_КоличествоКонтейнеров</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>омг_Преаналитика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Биоматериал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнутренняяЛаборатория_Биоматериалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контейнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнутренняяЛаборатория_ВидыКонтейнеров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>омг_Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ПолФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ПолФизическихЛиц</Name>
			<Comment>Пол физических лиц</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеУказан</Name>
					<Comment>Пол не указан</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мужской</Name>
					<Comment>Пол мужской</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Женский</Name>
					<Comment>Пол женский</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/омг_СтатусыЗаякиНаЛабИсследованиеВЛИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>омг_СтатусыЗаякиНаЛабИсследованиеВЛИС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Открыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленаВЛИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученРезультатИзЛИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтклоненоЛИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученЧастичныйРезультатИзЛИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕстьБракованныеПробы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Comment>Сотрудник, соответствующий данному пользователю</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрофилиПользователей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Омг_ВебКассаПользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Омг_ВебКассаПароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

HTTPServices/омг_ИнтеграцияССервисами/Ext/Module.bsl
Функция ПолучитьТокенАвторизации(СтруктураДанных, БазоваяАвторизация = Ложь)
	
	Если Не БазоваяАвторизация Тогда
		Если  СтруктураДанных = Неопределено 
			Или Не СтруктураДанных.Свойство("barcode") Тогда
			
			Возврат ПолучитьОтветОшибку(200, "INVALID_QUERY_STRUCTURE", 
				"Неверная структура запроса. Структура отличается от ожидаемой.");
			
		ИначеЕсли Не ЗначениеЗаполнено(СтруктураДанных.barcode) Тогда

			Возврат ПолучитьОтветОшибку(200, "INVALID_BARCODE", 
				"Неверный штрихкод авторизации.");
			
		КонецЕсли;
	КонецЕсли;
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("status", "success");
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(Пользователи.Сотрудник.Наименование, """") КАК СотрудникНаименование,
	               |	Пользователи.Наименование КАК Наименование,
	               |	ЕСТЬNULL(Пользователи.Профиль.Представление, """") КАК Профиль,
	               |	ЕСТЬNULL(Пользователи.Сотрудник.омг_ИдентификационныйКодЛичности, """") КАК ИИН,
	               |	Пользователи.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Пользователи КАК Пользователи
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА &БазоваяАвторизация
	               |				ТОГДА Пользователи.Ссылка = &ТекущийПользователь
	               |			ИНАЧЕ Пользователи.Сотрудник.омг_ИдентификационныйКодЛичности = &ИИН
	               |					И НЕ &ИИН = """"
	               |		КОНЕЦ";
	Запрос.УстановитьПараметр("ТекущийПользователь", Пользователи.ТекущийПользователь());
	Запрос.УстановитьПараметр("БазоваяАвторизация", БазоваяАвторизация);
	Запрос.УстановитьПараметр("ИИН", ?(СтруктураДанных = Неопределено, Неопределено, СтруктураДанных.barcode));
	ВыборкаПользователя = Запрос.Выполнить().Выбрать();
	
	Если НЕ ВыборкаПользователя.Следующий() Тогда
		
		Возврат ПолучитьОтветОшибку(200, "USER_NOT_FOUND", "Пользователь не найден.");
		
	КонецЕсли;
	
	Запись = РегистрыСведений.омг_ТокеныАвторизацииСервисов.СоздатьМенеджерЗаписи();
	Запись.Токен = Строка(Новый УникальныйИдентификатор);
	Запись.ДатаНачала = ТекущаяДата();
	Запись.ДатаОкончания = Запись.ДатаНачала + 3600 * 10;
	Запись.ВремяЖизниВСекундах = Запись.ДатаОкончания - Запись.ДатаНачала;
	Запись.Пользователь = ВыборкаПользователя.Ссылка;
	Запись.Записать();
	
	СтруктураПользователя = Новый Структура;
	СтруктураПользователя.Вставить("id", Строка(ВыборкаПользователя.Ссылка.УникальныйИдентификатор()));
	СтруктураПользователя.Вставить("name", ВыборкаПользователя.СотрудникНаименование);
	СтруктураПользователя.Вставить("login", ВыборкаПользователя.Наименование);
	СтруктураПользователя.Вставить("role", ВыборкаПользователя.Профиль);
	СтруктураПользователя.Вставить("barcode", ВыборкаПользователя.ИИН);
	
	СтруктураОтвета.Вставить("user", СтруктураПользователя);
	
	СтруктураСессии = Новый Структура;
	СтруктураСессии.Вставить("token", Запись.Токен);
	СтруктураСессии.Вставить("expires_in", Запись.ВремяЖизниВСекундах);
	
	СтруктураОтвета.Вставить("session", СтруктураСессии);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Ответ = Новый HTTPСервисОтвет(200);
	
	ТелоОтвета = ЗаписатьЗначениеJSON(СтруктураОтвета);
	
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета);
	
	Возврат Ответ;
		
КонецФункции

Функция ПолучитьОтветОшибку(КодСостояния, КодОшибки, ТекстОшибки)
	
	Ответ = Новый HTTPСервисОтвет(КодСостояния);
	Ответ.Заголовки.Вставить("Content-Type", "application/json");
	
	СтруктураОтвета = Новый Структура;
	
	СтруктураОтвета.Вставить("status", "error");
	СтруктураОтвета.Вставить("code", КодОшибки);
	СтруктураОтвета.Вставить("message", ТекстОшибки);
	
	ТелоОтвета = ЗаписатьЗначениеJSON(СтруктураОтвета);
	
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета, КодировкаТекста.UTF8);
	
	Возврат Ответ;
	
КонецФункции

Функция ПроверкаДоступаПоТокену(Токен)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	омг_ТокеныАвторизацииСервисов.Токен КАК Токен,
	               |	омг_ТокеныАвторизацииСервисов.Пользователь КАК Пользователь,
	               |	омг_ТокеныАвторизацииСервисов.Пользователь.Сотрудник КАК Сотрудник
	               |ИЗ
	               |	РегистрСведений.омг_ТокеныАвторизацииСервисов КАК омг_ТокеныАвторизацииСервисов
	               |ГДЕ
	               |	омг_ТокеныАвторизацииСервисов.ДатаОкончания >= &ДатаОкончания
	               |	И НЕ омг_ТокеныАвторизацииСервисов.ВремяЖизниВСекундах = 0
	               |	И омг_ТокеныАвторизацииСервисов.Токен = &Токен";
	Запрос.УстановитьПараметр("ДатаОкончания", ТекущаяДата());
	Запрос.УстановитьПараметр("Токен", Токен);
	РезультатЗапроса = Запрос.Выполнить();
	
	УстановитьПривилегированныйРежим(Ложь);;
	
	СтруктураТокена = Новый Структура("Доступен, Пользователь, Сотрудник", Ложь);
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		
		СтруктураТокена.Доступен = Истина;
		СтруктураТокена.Пользователь = Выборка.Пользователь;
		СтруктураТокена.Сотрудник = Выборка.Сотрудник;
	КонецЕсли;
	
	Возврат СтруктураТокена;
	
КонецФункции

Функция ОтказАвторизации(Запрос, СтруктураДанных, Ответ)


	Токен = Запрос.Заголовки.Получить("token");
	
	Отказ = Ложь;
	
	Если Не ЗначениеЗаполнено(Токен) Тогда
		
		Ответ = ПолучитьОтветОшибку(200, "NOT_AUTORIZATION", 
			"Токен не передан.");
		
		Отказ = Истина;
		
	КонецЕсли;
	
	АктуальныйТокен = ПроверкаДоступаПоТокену(Токен);
	
	Если Не АктуальныйТокен.Доступен Тогда
		
		Ответ = ПолучитьОтветОшибку(200, "INVALID_TOKEN", 
			"Токен доступа неверен или срок его действия истек.");
		
		Отказ = Истина;
		
	КонецЕсли;
	
	Если Не СтруктураДанных.Свойство("nr") Тогда
		
		Ответ = ПолучитьОтветОшибку(200, "INVALID_QUERY_STRUCTURE", 
			"Неверная структура запроса. Структура отличается от ожидаемой.");
		
		Отказ = Истина;
		
	КонецЕсли;  
	
	СтруктураДанных.Вставить("Пользователь", АктуальныйТокен.Пользователь);
	СтруктураДанных.Вставить("Сотрудник", АктуальныйТокен.Сотрудник);
	
	Возврат Отказ;
	
КонецФункции

Функция ПолучитьРезультатЗаявки(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type", "application/json");
	
	ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку();
	
	Попытка
		СтруктураДанных = ПрочитатьЗначениеJSON(ТелоЗапроса);

		Отказ = ОтказАвторизации(Запрос, СтруктураДанных, Ответ);
		
		Если Отказ Тогда
			Возврат Ответ;
		КонецЕсли;
		
	Исключение
		
		Ответ = ПолучитьОтветОшибку(200, "INVALID_QUERY_STRUCTURE", 
			"Неверная структура запроса. Ожидается структура в формате JSON.");
		
		Возврат Ответ;
		
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Истина);
	
	СоответствиеНастроекПоФилиалам = омг_ИнтеграцияСЛИС.ПолучитьДополнительныеНастройкиПоФилиалам(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Ссылка КАК Ссылка,
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Филиал.Представление КАК ФилиалПредставление,
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Фамилия КАК Фамилия,
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Имя КАК Имя,
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Отчество КАК Отчество,
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Пол КАК Пол,
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.ДатаРождения КАК ДатаРождения,
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.НомерЗаявки КАК Номер,
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Дата КАК Дата,
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Комментарий КАК Комментарий,
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Пациент.ИНН КАК ИИН,
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.ВремяЗабораМатериала КАК ВремяЗабораМатериала,
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Филиал КАК Филиал
	               |ПОМЕСТИТЬ ВТ_ДанныеДокумента
	               |ИЗ
	               |	Документ.омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС КАК омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС
	               |		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ ПЕРВЫЕ 1
	               |			омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСБиоматериалы.Проба КАК Проба,
	               |			омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСБиоматериалы.Ссылка КАК Ссылка
	               |		ИЗ
	               |			Документ.омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Биоматериалы КАК омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСБиоматериалы
	               |		ГДЕ
	               |			омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСБиоматериалы.Проба = &НомерЗаявки) КАК ВложенныйЗапрос
	               |		ПО омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Ссылка = ВложенныйЗапрос.Ссылка
	               |ГДЕ
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Проведен
	               |	И ВЫБОР
	               |			КОГДА омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.НомерЗаявки = &НомерЗаявки
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ВЫБОР
	               |					КОГДА ВложенныйЗапрос.Проба = &НомерЗаявки
	               |						ТОГДА ИСТИНА
	               |					ИНАЧЕ ЛОЖЬ
	               |				КОНЕЦ
	               |		КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДанныеДокумента.Ссылка КАК Ссылка,
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСБиоматериалы.Контейнер.Код КАК КонтейнерКод,
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСБиоматериалы.Биоматериал.Код КАК БиоматериалКод,
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСБиоматериалы.КодСтроки КАК КодСтроки,
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСБиоматериалы.Контейнер КАК Контейнер,
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСБиоматериалы.Биоматериал КАК Биоматериал,
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСБиоматериалы.НомерСтроки КАК НомерСтроки,
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСБиоматериалы.Проба КАК Штрихкод
	               |ПОМЕСТИТЬ ВТ_Биоматериалы
	               |ИЗ
	               |	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Биоматериалы КАК омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСБиоматериалы
	               |		ПО ВТ_ДанныеДокумента.Ссылка = омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСБиоматериалы.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДанныеДокумента.Ссылка КАК Ссылка,
	               |	ВТ_ДанныеДокумента.ФилиалПредставление КАК ФилиалПредставление,
	               |	ВТ_ДанныеДокумента.Фамилия КАК Фамилия,
	               |	ВТ_ДанныеДокумента.Имя КАК Имя,
	               |	ВТ_ДанныеДокумента.Отчество КАК Отчество,
	               |	ВТ_ДанныеДокумента.Пол КАК Пол,
	               |	ВТ_ДанныеДокумента.ДатаРождения КАК ДатаРождения,
	               |	ВТ_ДанныеДокумента.Номер КАК Номер,
	               |	ВТ_ДанныеДокумента.Дата КАК Дата,
	               |	ВТ_ДанныеДокумента.Комментарий КАК Комментарий,
	               |	ВТ_ДанныеДокумента.ИИН КАК ИИН,
	               |	ВТ_ДанныеДокумента.ВремяЗабораМатериала КАК ВремяЗабораМатериала,
	               |	ВТ_ДанныеДокумента.Филиал КАК Филиал
	               |ИЗ
	               |	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДанныеДокумента.Ссылка КАК Ссылка,
	               |	ВТ_Биоматериалы.КонтейнерКод КАК КонтейнерКод,
	               |	ВТ_Биоматериалы.БиоматериалКод КАК БиоматериалКод,
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСАнализыПоКонтейнерам.Номенклатура.Артикул КАК НоменклатураАртикул,
	               |	ВТ_Биоматериалы.Контейнер.омг_ИндексКартинки КАК ИндексКартинки,
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСАнализыПоКонтейнерам.Номенклатура.Представление КАК НоменклатураПредставление,
	               |	ВТ_Биоматериалы.КодСтроки КАК КодСтроки,
	               |	ВТ_Биоматериалы.НомерСтроки КАК НомерСтроки,
	               |	ВТ_Биоматериалы.Штрихкод КАК Штрихкод,
	               |	ЕСТЬNULL(ВнутренняяЛаборатория_СопоставлениеНоменклатуры.омг_Преаналитика, """") КАК Преаналитика,
	               |	ВТ_Биоматериалы.Контейнер.Наименование КАК КонтейнерНаименование
	               |ИЗ
	               |	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Биоматериалы КАК ВТ_Биоматериалы
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.АнализыПоКонтейнерам КАК омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСАнализыПоКонтейнерам
	               |			ПО ВТ_Биоматериалы.Ссылка = омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСАнализыПоКонтейнерам.Ссылка
	               |				И ВТ_Биоматериалы.КодСтроки = омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСАнализыПоКонтейнерам.КодСтроки
	               |		ПО ВТ_ДанныеДокумента.Ссылка = ВТ_Биоматериалы.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВнутренняяЛаборатория_СопоставлениеНоменклатуры КАК ВнутренняяЛаборатория_СопоставлениеНоменклатуры
	               |		ПО (ВТ_Биоматериалы.Биоматериал = ВнутренняяЛаборатория_СопоставлениеНоменклатуры.Биоматериал)
	               |			И (ВнутренняяЛаборатория_СопоставлениеНоменклатуры.Номенклатура = омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСАнализыПоКонтейнерам.Номенклатура)
	               |			И (ВнутренняяЛаборатория_СопоставлениеНоменклатуры.омг_Филиал = ВТ_ДанныеДокумента.Филиал)
	               |ИТОГИ
	               |	МАКСИМУМ(КонтейнерКод),
	               |	МАКСИМУМ(БиоматериалКод),
	               |	МАКСИМУМ(ИндексКартинки),
	               |	МАКСИМУМ(КодСтроки),
	               |	МАКСИМУМ(Штрихкод),
	               |	МАКСИМУМ(КонтейнерНаименование)
	               |ПО
	               |	НомерСтроки";
	Запрос.УстановитьПараметр("НомерЗаявки", СтруктураДанных.nr);
	
	ПакетРезультатов = Запрос.ВыполнитьПакет();
	
	Если ПакетРезультатов.Получить(2).Пустой() Тогда
		
		Возврат ПолучитьОтветОшибку(200, "REQUEST_NOT_FOUND", "Заявка с указанным штрихкодом не найдена.");
		
	КонецЕсли;
	
	Если ПакетРезультатов.Получить(2).Пустой() Тогда
		
		Возврат ПолучитьОтветОшибку(200, "REQUEST_EMPTY", "По данной заявке нет ни одной позиции биоматериалов.");
		
	КонецЕсли;
	
	ВыборкаДанныеДокумента = ПакетРезультатов.Получить(2).Выбрать();
	ВыборкаДанныеДокумента.Следующий();
	
	СтруктураЗаявки = Новый Структура;
	
	СтруктураПациента = Новый Структура;
	СтруктураЗаявки.Вставить("patient", СтруктураПациента);
	
	СтруктураПациента.Вставить("employee", ВыборкаДанныеДокумента.ФилиалПредставление);
	СтруктураПациента.Вставить("lastName", ВыборкаДанныеДокумента.Фамилия);
	СтруктураПациента.Вставить("firstName", ВыборкаДанныеДокумента.Имя);
	СтруктураПациента.Вставить("middleName", ВыборкаДанныеДокумента.Отчество);
	Если ВыборкаДанныеДокумента.Пол = Перечисления.ПолФизическихЛиц.Женский Тогда
		Пол = 2;
	ИначеЕсли ВыборкаДанныеДокумента.Пол = Перечисления.ПолФизическихЛиц.Мужской Тогда
		Пол = 1;
	Иначе
		Пол = 0;
	КонецЕсли; 
	СтруктураПациента.Вставить("gender", Пол);
	СтруктураПациента.Вставить("birthDay", ЗаписатьДатуJSON(ВыборкаДанныеДокумента.ДатаРождения, ФорматДатыJSON.ISO));
	
	СтруктураШапки = Новый Структура;
	СтруктураЗаявки.Вставить("referral", СтруктураШапки);
	
	НастройкиФилиала = СоответствиеНастроекПоФилиалам.Получить(ВыборкаДанныеДокумента.Филиал);
	
	СтруктураШапки.Вставить("nr", ВыборкаДанныеДокумента.Номер);
	СтруктураШапки.Вставить("prebarcoded", ?(НастройкиФилиала.Свойство("ИспользуетсяУникальноеШтрихкодирование"), 
		НастройкиФилиала.ИспользуетсяУникальноеШтрихкодирование, Ложь));
	СтруктураШапки.Вставить("date", ЗаписатьДатуJSON(ВыборкаДанныеДокумента.Дата, ФорматДатыJSON.ISO));
	СтруктураШапки.Вставить("samplingDate", ЗаписатьДатуJSON(ВыборкаДанныеДокумента.ВремяЗабораМатериала, ФорматДатыJSON.ISO));
	СтруктураШапки.Вставить("note", ВыборкаДанныеДокумента.Комментарий);
	СтруктураШапки.Вставить("iin", ВыборкаДанныеДокумента.ИИН);
	
	МассивКонтейнеров = Новый Массив;
	СтруктураЗаявки.Вставить("containers", МассивКонтейнеров);
	
	ВыборкаБиоматериалы = ПакетРезультатов.Получить(3).Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаБиоматериалы.Следующий() Цикл
		СтруктураКонтейнера = Новый Структура;
		МассивКонтейнеров.Добавить(СтруктураКонтейнера);
		
		СтруктураКонтейнера.Вставить("num", ВыборкаБиоматериалы.КодСтроки);
		СтруктураКонтейнера.Вставить("containerType", ВыборкаБиоматериалы.КонтейнерКод);
		СтруктураКонтейнера.Вставить("containerName", ВыборкаБиоматериалы.КонтейнерНаименование);
		СтруктураКонтейнера.Вставить("containerBarcode", ВыборкаБиоматериалы.Штрихкод);
		СтруктураКонтейнера.Вставить("biomaterialCode", ВыборкаБиоматериалы.БиоматериалКод);
		СтруктураКонтейнера.Вставить("imageIndex", ВыборкаБиоматериалы.ИндексКартинки);
		СтруктураКонтейнера.Вставить("count", 1);
		
		
		ВыборкаАнализов = ВыборкаБиоматериалы.Выбрать();
		
		МассивАнализов = Новый Массив;
		СтруктураКонтейнера.Вставить("assays", МассивАнализов);
		Пока ВыборкаАнализов.Следующий() Цикл
			Если Не ЗначениеЗаполнено(ВыборкаАнализов.Преаналитика) Тогда
				Продолжить;
			КонецЕсли;
			СтруктураАнализа = Новый Структура;
			СтруктураАнализа.Вставить("code", ВыборкаАнализов.НоменклатураАртикул);
			СтруктураАнализа.Вставить("name", ВыборкаАнализов.Преаналитика);
			МассивАнализов.Добавить(СтруктураАнализа);
		КонецЦикла;
	КонецЦикла;
	
	ТелоОтвета = ЗаписатьЗначениеJSON(СтруктураЗаявки);
	
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета, КодировкаТекста.UTF8);
	
	УстановитьПривилегированныйРежим(Ложь);  
	
	Возврат Ответ;
	
КонецФункции

Функция ЗаписатьШтрихкодыКонтейнеров(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type", "application/json");
	
	ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку();
	
	Попытка
		СтруктураДанных = ПрочитатьЗначениеJSON(ТелоЗапроса);

		Отказ = ОтказАвторизации(Запрос, СтруктураДанных, Ответ);
		
		Если Отказ Тогда
			Возврат Ответ;
		КонецЕсли;
		
	Исключение
		
		Ответ = ПолучитьОтветОшибку(200, "INVALID_QUERY_STRUCTURE", 
			"Неверная структура запроса. Ожидается структура в формате JSON.");
		
		Возврат Ответ;
		
	КонецПопытки;
	
	ТаблицаШтрихкодов = Новый ТаблицаЗначений;
	ТаблицаШтрихкодов.Колонки.Добавить("КодСтроки", ОбщегоНазначения.ОписаниеТипаЧисло(10));
	ТаблицаШтрихкодов.Колонки.Добавить("Штрихкод", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	
	Попытка
		Для Каждого ДанныеКонтейнера Из СтруктураДанных.containers Цикл
			СтрокаТаблицы = ТаблицаШтрихкодов.Добавить();
			СтрокаТаблицы.КодСтроки = ДанныеКонтейнера.num;
			СтрокаТаблицы.Штрихкод = ДанныеКонтейнера.containerBarcode;
		КонецЦикла;
	Исключение
		
		Ответ = ПолучитьОтветОшибку(200, "INVALID_QUERY_STRUCTURE", 
			"Неверная структура запроса. Контейнеры не переданы, либо структура отличается от ожидаемой.");
		
		Возврат Ответ;
		
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НомерЗаявки", СтруктураДанных.nr);
	Запрос.УстановитьПараметр("ТаблицаШтрихкодов", ТаблицаШтрихкодов);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаШтрихкодов.КодСтроки КАК КодСтроки,
	               |	ТаблицаШтрихкодов.Штрихкод КАК Штрихкод
	               |ПОМЕСТИТЬ ВТ_ТаблицаШтрихкодов
	               |ИЗ
	               |	&ТаблицаШтрихкодов КАК ТаблицаШтрихкодов
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ ВТ_ДанныеДокумента
	               |ИЗ
	               |	Документ.омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС КАК омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС
	               |ГДЕ
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.НомерЗаявки = &НомерЗаявки
	               |	И омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Проведен
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДанныеДокумента.Ссылка КАК Ссылка,
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСБиоматериалы.КодСтроки КАК КодСтроки,
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСБиоматериалы.НомерСтроки КАК НомерСтроки
	               |ПОМЕСТИТЬ ВТ_Биоматериалы
	               |ИЗ
	               |	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Биоматериалы КАК омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСБиоматериалы
	               |		ПО ВТ_ДанныеДокумента.Ссылка = омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСБиоматериалы.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДанныеДокумента.Ссылка КАК Ссылка
	               |ИЗ
	               |	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДанныеДокумента.Ссылка КАК Ссылка,
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСАнализыПоКонтейнерам.Номенклатура.Артикул КАК НоменклатураАртикул,
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСАнализыПоКонтейнерам.Номенклатура.Представление КАК НоменклатураПредставление
	               |ИЗ
	               |	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Биоматериалы КАК ВТ_Биоматериалы
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.АнализыПоКонтейнерам КАК омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСАнализыПоКонтейнерам
	               |			ПО ВТ_Биоматериалы.Ссылка = омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСАнализыПоКонтейнерам.Ссылка
	               |				И ВТ_Биоматериалы.КодСтроки = омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСАнализыПоКонтейнерам.КодСтроки
	               |		ПО ВТ_ДанныеДокумента.Ссылка = ВТ_Биоматериалы.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ТаблицаШтрихкодов.КодСтроки КАК КодСтроки,
	               |	ВТ_ТаблицаШтрихкодов.Штрихкод КАК Штрихкод,
	               |	ВТ_Биоматериалы.КодСтроки ЕСТЬ NULL КАК СтрокаОтсутствует,
	               |	ВТ_Биоматериалы.НомерСтроки КАК НомерСтроки
	               |ИЗ
	               |	ВТ_ТаблицаШтрихкодов КАК ВТ_ТаблицаШтрихкодов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Биоматериалы КАК ВТ_Биоматериалы
	               |		ПО (ВТ_Биоматериалы.КодСтроки = ВТ_ТаблицаШтрихкодов.КодСтроки)";
	
	ПакетРезультатов = Запрос.ВыполнитьПакет();
	
	Если ПакетРезультатов.Получить(3).Пустой() Тогда
		
		Возврат ПолучитьОтветОшибку(200, "REQUEST_NOT_FOUND", "Заявка с указанным штрихкодом не найдена.");
		
	КонецЕсли;
	
	Если ПакетРезультатов.Получить(4).Пустой() Тогда
		
		Возврат ПолучитьОтветОшибку(200, "REQUEST_EMPTY", "По данной заявке нет ни одной позиции биоматериалов.");
		
	КонецЕсли;
	
	ВыборкаШтрихкодов = ПакетРезультатов.Получить(5).Выбрать();
	Пока ВыборкаШтрихкодов.Следующий() Цикл
		Если ВыборкаШтрихкодов.СтрокаОтсутствует Тогда
			
			Ответ = ПолучитьОтветОшибку(200, "CONTAINER_TOT_FOUND", 
				"Контейнер с номером """ + ВыборкаШтрихкодов.КодСтроки + """ не найден.");
			
			Возврат Ответ;
			
		КонецЕсли;
	КонецЦикла;
	
	
	ВыборкаДанныеДокумента = ПакетРезультатов.Получить(3).Выбрать();
	ВыборкаДанныеДокумента.Следующий();
	
	
	ДокументОбъект = ВыборкаДанныеДокумента.Ссылка.ПолучитьОбъект();
	
	Если Истина = Ложь Тогда
		ДокументОбъект = Документы.омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.СоздатьДокумент();
	КонецЕсли;
	
	СтруктураПоиска = Новый Структура("КодСтроки");
	
	ВыборкаШтрихкодов.Сбросить();
	Пока ВыборкаШтрихкодов.Следующий() Цикл
		ДокументОбъект.Биоматериалы[ВыборкаШтрихкодов.НомерСтроки - 1].Проба = ВыборкаШтрихкодов.Штрихкод;
	КонецЦикла;
	
	ДокументОбъект.Медсестра = СтруктураДанных.Сотрудник;
	Попытка
		ДокументОбъект.Записать();
	Исключение
		
		Ответ = ПолучитьОтветОшибку(200, "ERROR_SAVE_REQUEST", 
			"Не удалось сохранить изменения по заявке. Заявка редактируется. Попробуйте позднее.");
		
		Возврат Ответ;
		
	КонецПопытки;
	
	омг_ЗаявкаЛИСОбщиеКлиентСерверныеПроцедуры.Обработчик_ПослеОтветаНаВопросОбОтправкеВЛИС(Неопределено, ДокументОбъект, Истина);
	
	Если Не ДокументОбъект.Статус = ПредопределенноеЗначение("Перечисление.омг_СтатусыЗаякиНаЛабИсследованиеВЛИС.ОтправленаВЛИС") Тогда
		Если ДокументОбъект.Ошибки.Количество() > 0 Тогда
			ТекстОшибки  = ДокументОбъект.Ошибки.Получить(ДокументОбъект.Ошибки.Количество() -1).ТекстОшибки;
			
			Ответ = ПолучитьОтветОшибку(200, "ERROR_SAVE_LIS", 
				"Не удалось отправить заявку в ЛИС. Текст ошибки ЛИС: " + ТекстОшибки);
		
			Возврат Ответ; 
		КонецЕсли;
	КонецЕсли;
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("status", "success");
	
	ТелоОтвета = ЗаписатьЗначениеJSON(СтруктураОтвета);
	
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета, КодировкаТекста.UTF8);
	
	УстановитьПривилегированныйРежим(Ложь);  
	
	Возврат Ответ;
	
КонецФункции

Функция АРММедсестрыПолучить(Запрос)
	
	Метод = Запрос.ПараметрыURL.Получить("metod");
	
	Авторизация = Запрос.Заголовки.Получить("Authorization");
	
	БазоваяАвторизация = Не Авторизация = Неопределено И Не СтрНайти(НРег(Авторизация), "basic") = 0;
	
	ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку();
	
	Попытка
		СтруктураДанных = ПрочитатьЗначениеJSON(ТелоЗапроса);
	Исключение
		СтруктураДанных = Неопределено;
	КонецПопытки;
	
	Если Метод = "auth" Тогда
		
		Если Не БазоваяАвторизация И СтруктураДанных = Неопределено Тогда
			
			Ответ = ПолучитьОтветОшибку(200, "AUTORIZATION_ERROR", "Неверные данные авторизации.");
			
		Иначе
		
			Ответ = ПолучитьТокенАвторизации(СтруктураДанных, БазоваяАвторизация);
		КонецЕсли;
		
	Иначе
		
		Ответ = ПолучитьОтветОшибку(200, "METOD_NOT_FOUND", "Метод не обнаружен.");
		
	КонецЕсли;
	
	Возврат Ответ;
КонецФункции

Функция АРММедсестрыОтправить(Запрос)
	
	Метод = Запрос.ПараметрыURL.Получить("metod");
	
	Авторизация = Запрос.Заголовки.Получить("Authorization");
	
	БазоваяАвторизация = Не Авторизация = Неопределено И Не СтрНайти(НРег(Авторизация), "basic") = 0;
	
	Если Метод = "find-request-by-nr" И Не БазоваяАвторизация Тогда
		
		Ответ = ПолучитьРезультатЗаявки(Запрос);
		
	ИначеЕсли Метод = "finish-request-by-nr" И Не БазоваяАвторизация Тогда
		
		Ответ = ЗаписатьШтрихкодыКонтейнеров(Запрос);
		
	Иначе
		
		Ответ = ПолучитьОтветОшибку(200, "METOD_NOT_FOUND", "Метод не обнаружен.");
		
	КонецЕсли;
	
	Возврат Ответ;
КонецФункции

Функция ИнтерфейсПациентаОтправить(Запрос)
	Ответ = Новый HTTPСервисОтвет(404);
	
	Возврат Ответ;
КонецФункции

Функция ИнтерфейсПациентаПолучить(Запрос)
	Ответ = Новый HTTPСервисОтвет(404);
	
	Возврат Ответ;
КонецФункции
